Samples/MarkCertificateAsUsedRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
         <wsu:Timestamp wsu:Id="Timestamp-20046406" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
            <wsu:Expires>2020-01-11T10:33:52.303Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="UsernameToken-20914066" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsse:Username>mtn</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">JC9UDunh4V5pRSEofoUgTur9u5g=</wsse:Password>
            <wsse:Nonce>5lXRolFB0oWSOjRgioe4DA==</wsse:Nonce>
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ns4:MarkCertificateAsUsedRequest xmlns:ns4="http://www.ibsplc.com/iloyal/redemption/markcertificateasused/type/">
         <certificate>
            <companyCode>SA</companyCode>
            <programCode>VOYAG</programCode>
            <certificateNumber>1000109809</certificateNumber>
            <closedDate>04-Mar-2015</closedDate>
            <partnerCode>MTS</partnerCode>
            <rewardCode>MTSR1</rewardCode>
            <rewardGroup>L</rewardGroup>
            <rewardDiscount>0.0</rewardDiscount>
            <membershipNumber>32757624</membershipNumber>
            <title>MR</title>
            <givenName>MARK</givenName>
            <familyName>PENWILL</familyName>
            <issueDate>04-Mar-2015</issueDate>
         </certificate>
         <txnHeader>
            <transactionID>55D6308230786FB3D994D3DDBD3AE5AA</transactionID>
            <userName>mtn</userName>
            <timeStamp>2015-02-16T09:06:18.555+02:00</timeStamp>
         </txnHeader>
      </ns4:MarkCertificateAsUsedRequest>
   </soapenv:Body>
</soapenv:Envelope>